Revit 2027 API
IFCAggregate.AddValueOfType Method
 Adds an ifc object with primitive type of aggregate's item type to the aggregate.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddValueOfType(
	string typeName
)
Public Sub AddValueOfType (
	typeName As String
)
public:
void AddValueOfType(
	String^ typeName
)
member AddValueOfType :
        typeName : string -> unit
Parameters
typeName String
 The type name.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The aggregate is not valid.
See Also
Reference
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace